// // Переменные в JavaScript
// // Задача №1
// // Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.

// let num = 123;
// alert(num);




// // Объявление нескольких переменных
// // Задача №2
// let a = 1, b = 2, c = 3;
// console.log(a);




// let a;
// let b;
// let c;

// a = 1;
// b = 2;
// c = 3;
// console.log(a);




// let a = 1;
// let b = 2;
// let c = 3;
// console.log(a);




// // Задача №3
// // Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.

// let a = 10;
// console.log(a);
// a = 20;
// console.log(a);














// // Числа и операции над ними в JavaScript
// // Задача №1
// // Создайте переменную a. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

// let a = 1 + 2 + 3;
// alert(a);




// // Задача №2
// // Выведите с помощью функции alert сумму чисел 1, 2 и 3.

// alert(1 + 2 + 3);




// // Операции над переменными
// // Задача №3
// // Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления).

// let a = 10;
// let b = 2;
// console.log(a + b);
// console.log(a / b);
// console.log(a * b);
// console.log(a - b);




// // Задача №4
// // Создайте переменную c со значением 10 и переменную d со значением 5. 
// // Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

// let c       = 10;
// let d       = 5;
// let result  = c + d;
// console.log(result);




// // Задача №5
// // Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. Выведите на экран их сумму.

// let a = 1, b = 2, c = 3;
// console.log(a + b + c);




// // Задача №6
// // Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.
// // Затем создайте переменную d, присвойте ей значение 7. 
// // Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

// let a = 10;
// let b = 5;
// let c = a - b;
// let d = 7;
// let result = c + d;
// console.log(result);




// // Дроби
// // Задача №7
// // Запишите в переменную a число 1.5, а в переменную b - число 0.75. Найдите сумму значений этих переменных и выведите ее на экран.

// let a = 1.5;
// let b = 0.75;
// let result = a + b;
// console.log(result);




// // Отрицательные числа
// // Задача №8
// // Создайте переменную a со значением -100. Выведите это значение на экран.

// let a = -100;
// console.log(a);




// // Задача №9
// // Создайте переменную a, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.

// let a = 5;
// console.log(-a);




// // Остаток от деления
// // Задача №10
// // Дана переменная a со значением 10 и переменная b со значением 3. Найдите остаток от деления a на b.

// let a = 10;
// let b = 3;
// let result = a % b;
// console.log(result);




// // Возведение в степень
// // Задача №11
// // Возведите число 2 в 10-ю степень. Выведите результат на экран.

// let a = 2;
// let b = 10;
// console.log(a ** b);














// // Строки в JavaScript
// // Задача №1
// // Создайте переменную str и присвойте ей строку '!!!'. Выведите значение этой переменной на экран.

// let str = '!!!';
// console.log(str);




// // Задача №2
// // Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите на экран строку 'javascript'.

// let str1 = 'java';
// let str2 = 'script';
// console.log(str1 + str2);




// // Задача №3
// // Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите на экран строку 'hello world'.

// let str1 = 'hello';
// let str2 = 'world';
// console.log(str1 + ' ' + str2);




// // Задача №4
// // Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'привет, %имя%'. Вместо %имя% должно подставится значение из переменной name.

// let name    = 'Александр';
// console.log('Привет, ' + name);




// // Задача №5
// // Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'мне %возраст% лет'. Вместо %возраст% должно подставится значение из переменной age.

// let age = 25;
// console.log('Мне ' + age + ' лет');




// // Задача №6
// // Запишите в переменную какую-нибудь строку. Выведите на экран длину вашей строки.

// let str = 'adv t';
// console.log(str.length);




// // Задача №7
// // Запишите в переменную str строку, состоящую из символов 'a', 'b', 'c', причем после каждого символа, кроме последнего, должен стоять перенос строки. 
// // Выведите значение переменной на экран.

// let str = `a
// b
// c`;
// console.log(str);














// // Специальные значения в JavaScript
// // Задача №1
// // Объявите переменную, не задавая ей значения. Выведите значение созданной переменной на экран.

// let a;
// console.log(a);




// // Задача №2
// // Присвойте переменной значение null. Выведите эту переменную на экран.

// let a = null;
// console.log(a);




// // Задача №3
// // Присвойте переменной значение true. Выведите эту переменную на экран.

// let boolean = true;
// console.log(boolean);




// // Задача №4
// // Присвойте переменной значение false. Выведите эту переменную на экран.

// let boolean = false;
// console.log(boolean);




// // Задача №5
// // Сделайте две строки. Перемножьте их друг на друга. Выведите результат умножения на экран.

// let str1 = 'abc',
//     str2 = 'bca';
// console.log(str1 * str2);




// Задача №6
// Поделите число 10 на 0. Выведите результат на экран.

// console.log(10 / 0);




// // Задача №7
// // Поделите число -10 на 0. Выведите результат на экран.

// console.log(-10 / 0);














// // Практика по работе с переменными и операциями в JavaScript
// // Количество секунд
// // Задача №1
// // Найдите количество секунд в сутках.

// let secondsOnDay    = 60 * 60 * 24;
// console.log(secondsOnDay);




// // Задача №2
// // Найдите количество секунд в 30 сутках.

// console.log(60 * 60 * 24 * 30);




// // Задача №3
// // Найдите количество секунд в году.

// console.log(60 * 60 * 24 * 365);




// // Задача №4
// // Найдите количество минут в сутках.

// console.log(60 * 24);




// // Задача №5
// // Найдите количество минут в году.

// console.log(60 * 365);




// // Перевод в байты и наоборот
// // Задача №6
// // Найдите количество байт в мегабайте.

// let mb  = 1;
// let kb  = mb * 1024;
// console.log(kb);




// // Задача №7
// // Найдите количество байт в гигобайте.

// console.log(1024 * 1024 * 1024);




// Задача №8
// Найдите количество байт в 10 гигобайтах.

// console.log(1024 * 1024 * 1024 * 10);




// // Задача №9
// // Найдите количество байт в терабайте.

// console.log(1024 * 1024 * 1024 * 1024);




// // Задача №10
// // Найдите количество килобайт в терабайте.

// console.log(1024 * 1024 * 1024);




// // Площади фигур
// // Задача №11
// // Пусть дана переменная r с радиусом круга. 
// // По соответствующей формуле найдите площадь круга и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

// let r = 10;
// let s = 3.14 * r ** 2;
// console.log(s);




// // Задача №12
// // Пусть дана переменная a со стороной квадрата. Найдите площадь квадрата и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

// let a = 10;
// let s = a ** 2;
// console.log(s);




// // Задача №13
// // Пусть даны переменные a и b со сторонами прямоугольника. Найдите площадь прямоугольника и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

// let a = 10;
// let b = 3;
// let s = a * b;
// console.log(s);




// // Задача №14
// // Пусть даны переменные a и b со сторонами прямоугольника. 
// // Найдите периметр прямоугольника и запишите его в переменную p. Выведите содержимое этой переменной на экран.

// let a = 10;
// let b = 3;
// let p = (a * 2) + (b * 2);
// console.log(p);




// // Из Цельсия в Фарингейты и наоборот
// // Задача №15
// // Пусть дана переменная tc с температурой в градусах Цельсия. По соответствующей формуле выполните перевод этой температуры в градусы Фарингейта.

// let tc = 36;
// let f  = (5 / 9 * 32) * 36;
// console.log(f);














// // Принудительное преобразование типов данных в JavaScript
// // Задача №1
// // Дана переменная a со значением '10' и переменная b со значением '20'. Сложите данные переменные как числа.

// let a = '10';
// let b = '20';
// console.log(Number(a) + Number(b));




// // Задача №2
// // Дан код:
// // let a = '2';
// // let b = '3';
// // alert(a + b); // выведет '23'
// // С помощью описанного приема с плюсом исправьте приведенный код так, чтобы в переменные a и b присваивалось число, а не строка, ну и результатом, 
// // соответственно, было не '23', а 5.

// let a = +'2';
// let b = +'3';
// console.log(a + b);




// // Выделение числа
// // Задача №3
// // Дана переменная со значением 5px и переменная со значением 6px. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.

// let a = '5px';
// let b = '6px';
// console.log(parseInt(a) + parseInt(b));




// // Задача №4
// // Дана переменная со значением 5.5px и переменная со значением 6.25px. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.

// let a = '5.5px';
// let b = '6.25px';
// console.log(parseFloat(a) + parseFloat(b));




// // Задача №5
// // Модифицируйте предыдущую задачу так, чтобы к выводящемуся результату добавлялись буквы 'px'. 
// // То есть, если наша сумма равна 11.75, то на экран пусть выведется 11.75px.

// let a = '5.5px';
// let b = '6.25px';
// console.log(parseFloat(a) + parseFloat(b) + 'px');




// // Преобразование к строке
// // Задача №6
// // Даны две переменные с числами. Сложите значения этих переменных как строки и выведите результат на экран.

// let a = 5;
// let b = 2;
// console.log(String(a) + String(b));




// // Применение преобразование к строке
// // Задача №7
// // Дана переменная с числом. Найдите количество цифр в этом числе.

// let num = 10;
// console.log(String(num).length);




// // Задача №8
// // Даны две переменные с числами. Найдите количество цифр в одном и во втором числе, результаты сложите и выведите на экран.

// let a = 10;
// let b = 25;
// console.log(String(a).length + String(b).length);














// // Получение символов строки на JavaScript
// // Задача №1
// // Дана строка 'abcde'. Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.

// let str = 'abcde';
// console.log(str[0]);
// console.log(str[2]);
// console.log(str[4]);




// // Задача №2
// // Дана переменная со строкой 'abcde'. Обращаясь к отдельным символам этой строки запишите в новую переменную символы этой строки в обратном порядке, то есть 'edcba'.

// let str     = 'abcde';
// let newStr  = str[4] + str[3] + str[2] + str[1] + str[0];
// console.log(newStr);




// // Задача №3
// // Дана переменная str со строкой 'abcde' и переменная num с номером символа. Выведите на экран символ, номер которого хранится в переменной num.

// let str = 'abcde';
// let num = 2;
// console.log(str[num]);




// // Задача №4
// // Дана строка. Выведите на экран ее последний символ.

// let str         = 'abcdeb';
// let lastSymbol  = str.length - 1;
// console.log(str[lastSymbol]);




// // Задача №5
// // Дана строка. Выведите на экран ее предпоследний символ.

// let str         = 'abcdeb';
// let lastSymbol  = str.length - 2;
// console.log(str[lastSymbol]);




// // Задача №6
// // Дана строка. Выведите на экран ее предпредпоследний символ.

// let str         = 'abcdeb';
// let lastSymbol  = str.length - 3;
// console.log(str[lastSymbol]);




// // Строки с цифрами
// // Задача №7
// // Дана строка '12345'. Найдите сумму цифр этой строки.

// let str     = '12345';
// let result  = Number(str[0]) + Number(str[1]) + Number(str[2]) + Number(str[3]) + Number(str[4]);
// console.log(result);




// // Обращение к цифрам числа
// // Задача №8
// // Дано число 12345. Найдите сумму цифр этого числа.

// let num     = 12345;
// let str     = String(num);
// let result  = Number(str[0]) + Number(str[1]) + Number(str[2]) + Number(str[3]) + Number(str[4]);
// console.log(result);




// // Задача №9
// // Дано число 12345. Найдите произведение цифр этого числа.

// let num = 12345;
// let str = String(num);
// console.log(str[0] * str[1] * str[2] * str[3] * str[4]);




// // Задача №10
// // Дано число 12345. Переставьте цифры этого числа в обратном порядке.

// let num = 12345;
// let str = String(num);
// let result = Number(str[4] + str[3] + str[2] + str[1] + str[0]);
// console.log(result);














// // Сокращенные операции в JavaScript
// // Задача №1
// // Переделайте этот код так, чтобы в нем использовались описанные сокращенные операции:

// // let num = 47;
// // num = num + 7;
// // num = num - 18;
// // num = num * 10;
// // num = num / 15;
// // alert(num);


// let num = 47;
// num += 7;
// num -= 18;
// num *= 10;
// num /= 15;
// console.log(num);















// // Операции инкремента и декремента в JavaScript
// // Задача №1
// // Переделайте этот код так, чтобы в нем операции инкремента и декремента:

// // let num = 10;
// // num = num + 1;
// // num = num + 1;
// // num = num - 1;
// // alert(num);


// let num = 10;
// num++;
// num++;
// num--;
// console.log(num);














// // Функция prompt в JavaScript
// // Задача №1
// // Спросите возраст пользователя с помощью функции prompt. Выведите с помощью alert введенный пользователем возраст.

// let namePerson = prompt('Ваше имя?');
// console.log(namePerson);




// // Задача №2
// // Переделайте приведенный выше код так, чтобы суммировались числа, а не строки.

// let num1 = prompt('Введите первое число');
// let num2 = prompt('Введите второе число');
// console.log(Number(num1) + Number(num2));




// // Задача №3
// // С помощью функции prompt спросите у пользователя сторону квадрата. Выведите на экран площадь введенного квадрата.

// let ansverPerson    = prompt('Введите сторону квадрата, чтобы получить его площадь');
// console.log(Number(ansverPerson) ** 2);




// Задача №4
// С помощью двух функций prompt спросите у пользователя стороны прямоугольника. Выведите на экран периметр введенного прямоугольника.

let ansver1 = prompt('Введите первую сторону прямоугольника');
let ansver2 = prompt('Введите вторую сторону прямоугольника');
console.log('Периметр прямоугольника равен: ' + (Number(ansver1) ** 2 + Number(ansver2) ** 2));